[
    {
        "title": "Procedural Forest",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146786962263511091/Forest.jpg",
                "caption": "A view of the forest from eye level"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146786963219812352/Grass.jpg",
                "caption": "A view of the grass system"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146786961575641169/Water.jpg",
                "caption": "A birds eye view of the water system"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146786963744104488/Trees.jpg",
                "caption": "A view of the trees from beneath"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146786962640994335/forest.png",
                "caption": "A view of the forest from above"
            }
        ],
        "text": [
            "This forest is built entirely procedually - in terms of both model and texture. It is built within the procedural system brought in by Blender 3 (this specifically was build in version 3.1)",
            "Starting with the grass, this is generated by building a single blade of grass from a bezier curve with a gradient at the top and bottom to create the idea of the grass getting thinner and thicker based on the location on the blade. Each blade is then pulled into a clump of 5 blades, all of which are then placed onto the ground model through 2 procedural maps, a noise texture to place it randomly, and a musgrave texture to invent a sense of 'patchyness', allowing it to more accurately simulate real grass.",
            "The trees then are generated with a similar idea in mind as the grass, just much thicker. And the initial branches in a similar method as well just without the musgrave patchyness and the noise rapped around the trunk rather than the ground. However, the branches after that are generated differently. They use a system of recursion where they continue to place instances of themselves however everytime an instance of itself is created, the chance of the next instance being a leaf rather than a branch increases until up to around 6 instance levels where it is guarenteed that all branches are leaves. This pseudo-randomness further pushes the element of photorealism by simulating the logic of real trees.",
            "The water is the final component of this stage. It is generated using a second musgrave texture which determines plots to lower the ground, underneath the ground layer is a 4 dimensionally textured (for the effect of flowing water) block of water that is only visible when the map lowers the ground to below that level.",
            "I believe this creation to be my finest piece of work and best to accurately display my abilities as a 3D student. This is due to the fact that it accurately demonstrates what can be achieved by merging 3D art, the mathematics of modelling, observed natural logic and computational concepts such as recursion."
        ],
        "languages": "Blender's Geometry Nodes system"
    },
    {
        "title": "The Classic Blender Doughnut",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146795590286585862/Doughnut.jpg",
                "caption": "A render of the doughnut from the top"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146795589695176784/double_ds.png",
                "caption": "A render of the doughnut from the side"
            }
        ],
        "text": [
            "When most people start learning 3D modelling in todays common era, they use the free application Blender. When most people learn Blender, they go to an australian youtuber named Blender Guru. I was no exception to this idea. I learned the basics of polygonal modelling and node based texturing from this series and resulted in these rather high quality doughnut.",
            "This was the first thing that inspired me to continue modelling and rendering as I found it easy and achievable due to its more programmatic and mathematical approach"
        ],
        "languages": "Blender"
    },
    {
        "title": "Spiderman",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146807678274895902/spooderman.png",
                "caption": "A spiderman with purple, glowing markings"
            }
        ],
        "text": [
            "While the original spiderman model is not homemade, the cape and environment are. The entire scene is designed to implement a horror-esque effect. The cloak is modelled using Blender's physics engine and the spiderman model is animated using Cascadeur. The song is a cover of Paint it Black from the rolling stones."
        ],
        "languages": "Blender",
        "link": "https://cdn.discordapp.com/attachments/833059868767158276/1146808220631973888/635741_final.mp4"
    },
    {
        "title": "Eldritch Dagger",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146808813597503608/EldritchDagger.jpg",
                "caption": "A curved and crooked dagger"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146808813089980556/Dagger.jpg",
                "caption": "A Basic Dagger"
            }
        ],
        "text": [
            "This dagger was my first production in Maya, combinaing basic polygons with a small amount of polygonal moulding to build the blade itself. The original design was conceptualised by Destiny 2 with their hand cannon 'Thorn'. Such was designed to be represent a certain element of evil and betrayal.",
            "This dagger was one of my first polygonal models within blender. While simple, it represents a large milestone in my development as a 3D artist due to its non-standard shaping and the use of colour."
        ],
        "languages": "Maya (1st one) & Blender (2nd one)"
    },
    {
        "title": "Floating Island",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809011291836447/V1.png",
                "caption": "A cubic island with minimal detail"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809012025835631/V2.png",
                "caption": "A more rounded island"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809010306162728/V3.png",
                "caption": "A floating island with trees"
            }
        ],
        "text": [
            "This was generated procedurally by using technology from the procedural forest. The first iteration was focussing on the general shape of the island. It was only designed to be small and therefore there was little space for foliage and the like.",
            "The second iteration focussed more on the details of the shape of the island, giving more volume and allowing the layering of muds and stones to be more apparent and more consistent.",
            "The final iteration focussed upon moving trees to the island, they are mostly copied across from the forest project"
        ],
        "languages": "Blender's Geometry Nodes system"
    },
    {
        "title": "Jeremy the rat",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809046922432663/FINAL.png",
                "caption": "A cartonnish rat holding a sword"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809046582706298/Rat.jpg",
                "caption": "An unlit version of the rat"
            }
        ],
        "text": [
            "The final stage of modelling is character generation. The ability to build the anatomical and visible structure of a character is considered one of the most difficult and also most important stages of learning 3D modelling. Mostly due to the fact that this requires an in-depth knowledge and analysis of the structure of these characters, they then must rig these in such a way that the built mesh can be reformed in such a way that it appears natural. These require much more careful effort.",
            "Shaders were also a careful consideration as these are intended to be more blunt in terms of shading. Meaning that there is less of a gradient between colours and rather static changes. This presents a feel of being hand drawn which allows this work to feel more in line with the concept of a cartoon style."
        ],
        "languages": "Blender"
    },
    {
        "title": "Procedural slime texture",
        "images": [
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809703414911126/Slime.jpg",
                "caption": "A green ball with a wave like texture"
            },
            {
                "src": "https://cdn.discordapp.com/attachments/833059868767158276/1146809702861250720/Slime.gif",
                "caption": "A purple, transluscent sphere with moving effects"
            }
        ],
        "text": [
            "This slime texture takes advantage of the nature of 4 dimensions. Imagine a 3 Dimensional cube if you will, when you travel up one axis, the other 2 axis get smaller as you get further away from their origin. However, this is not a snapping sort of motion, rather it is a continual shrinking movement. This mode of movement is useful however the direction is wrong.",
            "No matter which axis we travel across, the other 2 axis will get smaller in a 3 dimensional shape. What we need is a 4th axis, one that can manipulate our perspective of the other 3. This is where the concept of a 4D object comes in. This continual movement without the shrinking of individual axis creates a flowing-like movement. This concept can then be applied to a model to give it a fluid texture."
        ],
        "languages": "Blender's node based shader editor"
    }
]